[Survived] StringLiteral
pgats-ci-desafio01/src/components/choose-ride.component.js:34:24
     img.src = ride.image;
     const anchor = /** @type {HTMLAnchorElement} */ (row.class.cardLink);
     anchor.href = `#ride/${ride.id}`;
-    anchor.innerText = `Choose ${ride.name}`;
+    anchor.innerText = ``;
     anchor.addEventListener('click', (e) => {
       e.preventDefault();
