[Killed] StringLiteral
pgats-ci-desafio01/src/components/choose-ride.template.js:14:26
 `;
 
 export const templateRide = document.createElement('template');
-templateRide.innerHTML = `
-  <div class="col-12 col-md-6 col-lg-4">
-    <div class="card">
-      <img class="card-img-top" src="" alt="Card image cap">
-      <div class="card-body">
-        <h5 class="card-title">Ride name</h5>
-        <p class="card-text">Ride description</p>
-        <a href="#" class="card-link btn btn-primary">Choose</a>
-      </div>
-    </div>
-  </div>
-`;
+templateRide.innerHTML = ``;
 
killedBy: All tests
statusReason: > robo-coasters-example@1.0.0 test
> node --experimental-vm-modules node_modules/jest/bin/jest.js


(node:4034) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/components/robo-coasters.component.spec.js
