[Killed] StringLiteral
pgats-ci-desafio01/src/components/robo-coasters.component.js:40:12
       case 'ride':
         this.view.innerHTML = `<robo-ride ride-id="${this.route[1]}"></robo-ride>`;
         break;
-      case 'success':
+      case "":
         this.view.innerHTML = `<robo-success></robo-success>`;
         break;
killedBy: All tests
statusReason: > robo-coasters-example@1.0.0 test
> node --experimental-vm-modules node_modules/jest/bin/jest.js


(node:10937) ExperimentalWarning: VM Modules is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

PASS test/pipes/rides-summary.pipe.spec.js
