[Survived] StringLiteral
pgats-ci-desafio01/src/pipes/rides-summary.pipe.js:6:26
  * @return {string}
  */
 export function ridesSummary(order) {
-  let shortDescription = '';
+  let shortDescription = "Stryker was here!";
   let people = 'people';
   if (order.ride.minHeight) {

[Survived] ConditionalExpression
pgats-ci-desafio01/src/pipes/rides-summary.pipe.js:8:7
 export function ridesSummary(order) {
   let shortDescription = '';
   let people = 'people';
-  if (order.ride.minHeight) {
+  if (false) {
     shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
   }
